docs: modernize system view
